.emacs.d/Emacs.org
** Let's Be Evil

Some tips can be found here:

- https://github.com/noctuid/evil-guide
- https://nathantypanski.com/blog/2014-08-03-a-vim-like-emacs-config.html

#+begin_src emacs-lisp

    (use-package undo-tree
      :init
      (setq undo-tree-auto-save-history t)
      (global-undo-tree-mode 1))

    (use-package evil
      :init
      (setq evil-want-integration t)
      (setq evil-want-keybinding nil)
      (setq evil-want-C-u-scroll nil)
      (setq evil-want-C-d-scroll nil)
      (setq evil-want-C-i-jump nil)
      (setq evil-respect-visual-line-mode t)
      (setq evil-undo-system 'undo-tree)
      :config
      (evil-mode 1)
      (require 'subr-x)
      ;; Set Emacs state modes
      (dolist (mode '(custom-mode
                      eshell-mode
                      git-rebase-mode
                      term-mode))
        (add-to-list 'evil-emacs-state-modes mode))

      (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

      ;; Basic movement
      (define-key evil-normal-state-map (kbd "C-f") 'evil-forward-char)
      (define-key evil-normal-state-map (kbd "C-b") 'evil-backward-char)
      (define-key evil-normal-state-map (kbd "C-n") 'evil-next-line)
      (define-key evil-normal-state-map (kbd "C-p") 'evil-previous-line)

      ;; Word movement
      (define-key evil-normal-state-map (kbd "M-f") 'evil-forward-word-end)
      (define-key evil-normal-state-map (kbd "M-b") 'evil-backward-word-begin)
      (define-key evil-insert-state-map (kbd "M-f") 'evil-forward-word-end)
      (define-key evil-insert-state-map (kbd "M-b") 'evil-backward-word-begin)

      ;; python jump to prev/next def
      (defun my-python-nav-forward-defun ()
        (interactive)
        (let ((current-pos (point)))
          (python-nav-forward-defun)
          (when (equal (point) current-pos)
            (message "Reached the last def in the file"))))

      (defun my-python-nav-backward-defun ()
        (interactive)
        (let ((current-pos (point)))
          (python-nav-backward-defun)
          (when (equal (point) current-pos)
            (message "Reached the first def in the file"))))

      ;; (evil-define-key 'normal python-mode-map (kbd "C-f n") 'my-python-nav-forward-defun)
      ;; (evil-define-key 'normal python-mode-map (kbd "C-f p") 'my-python-nav-backward-defun)
      ;; (evil-define-key 'emacs python-mode-map (kbd "C-f n") 'my-python-nav-forward-defun)
      ;; (evil-define-key 'emacs python-mode-map (kbd "C-f p") 'my-python-nav-backward-defun)

      ;; Line movement
      (define-key evil-normal-state-map (kbd "C-a") 'move-beginning-of-line)
      (define-key evil-normal-state-map (kbd "C-e") 'move-end-of-line)
      (define-key evil-insert-state-map (kbd "C-e") 'evil-end-of-line)
      (define-key evil-insert-state-map (kbd "C-a") 'evil-beginning-of-line)

      (define-key evil-normal-state-map (kbd "M-$") 'evil-scroll-line-down)
      (define-key evil-normal-state-map (kbd "C-$") 'evil-scroll-line-up)

      (define-key evil-normal-state-map (kbd "M-n") 'next-buffer)
      (define-key evil-normal-state-map (kbd "M-p") 'previous-buffer)

      (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
      (evil-global-set-key 'motion "j" 'evil-next-visual-line)
      (evil-define-key 'normal org-mode-map (kbd "M-n") 'org-babel-next-src-block)

      (evil-define-key 'normal org-mode-map (kbd "M-p") 'org-babel-previous-src-block)
      (evil-define-key 'emacs org-mode-map (kbd "M-n") 'org-babel-next-src-block)
      (evil-define-key 'emacs org-mode-map (kbd "M-p") 'org-babel-previous-src-block)

      ;; (evil-global-set-key 'normal (kbd "M-n") 'next-buffer)
      ;; (evil-global-set-key 'normal (kbd "M-p") 'previous-buffer)

      (defun dw/dont-arrow-me-bro ()
        (interactive)
        (message "Arrow keys are bad, you know?"))

      ;; Disable arrow keys in normal and vsual modes
      ;; (define-key evil-normal-state-map (kbd "<left>") 'dw/dont-arrow-me-bro)
      ;; (define-key evil-normal-state-map (kbd "<right>") 'dw/dont-arrow-me-bro)
      ;; (define-key evil-normal-state-map (kbd "<down>") 'dw/dont-arrow-me-bro)
      ;; (define-key evil-normal-state-map (kbd "<up>") 'dw/dont-arrow-me-bro)
      ;; (evil-global-set-key 'motion (kbd "<left>") 'dw/dont-arrow-me-bro)
      ;; (evil-global-set-key 'motion (kbd "<right>") 'dw/dont-arrow-me-bro)
      ;; (evil-global-set-key 'motion (kbd "<down>") 'dw/dont-arrow-me-bro)
      ;; (evil-global-set-key 'motion (kbd "<up>") 'dw/dont-arrow-me-bro)

      (evil-set-initial-state 'messages-buffer-mode 'normal)
      (evil-set-initial-state 'dashboard-mode 'normal))

    (use-package evil-collection
      :after evil
      :init
      (setq evil-collection-company-use-tng nil)
      :config
      (evil-collection-init))

#+end_src

#+RESULTS:
: t

** Keybinding Panel (which-key)
[[https://github.com/justbur/emacs-which-key][which-key]] is great for getting an overview of what keybindings are available
based on the prefix keys you entered.  Learned about this one from Spacemacs.

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3)
    (setq which-key-popup-type 'frame)
    (which-key-mode)
    (which-key-setup-side-window-bottom))


#+end_src

#+RESULTS:
: t
** Simplify Leader Bindings (general.el)

[[https://github.com/noctuid/general.el][general.el]] is a fantastic library for defining prefixed keybindings, especially
in conjunction with Evil modes.

#+begin_src emacs-lisp
  (use-package general
    :after evil
    :config
    (general-evil-setup t)
    (general-create-definer dw/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (dw/leader-key-def
      "t" '(:ignore t :which-key "toggles")))

#+end_src

#+RESULTS:
: t

* General Configuration
** User Interface
Clean up Emacs' user interface, make it more minimal.

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)      ; Give some breathing room
  (menu-bar-mode -1)            ; Disable the menu bar
  (setq visible-bell nil)  ; Disable visible bell

#+end_src

#+RESULTS:

Improve scrolling.

#+begin_src emacs-lisp

  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
  (setq scroll-step 1) ;; keyboard scroll one line at a time
  ;; (setq use-dialog-box nil) ;; Disable dialog boxes since they weren't working in Mac OSX

#+end_src

#+RESULTS:
: 1

Set frame transparency and maximize windows by default.

#+begin_src emacs-lisp

  (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

#+RESULTS:
: ((fullscreen . maximized) (alpha 90 . 90) (vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))

Enable line numbers and customize their format.

#+begin_src emacs-lisp

  (column-number-mode)

  ;; Enable line numbers for some modes
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))

  ;; Override some modes which derive from the above
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

#+RESULTS:

Don't warn for large files (shows up when launching videos)

#+begin_src emacs-lisp

  (setq large-file-warning-threshold nil)

#+end_src

#+RESULTS:

Don't warn for following symlinked files

#+begin_src emacs-lisp

  (setq vc-follow-symlinks t)

#+end_src

#+RESULTS:
: t

Don't warn when advice is added for functions

#+begin_src emacs-lisp

  (setq ad-redefinition-action 'accept)

#+end_src

#+RESULTS:
: accept
#+begin_src emacs-lisp
  (use-package git-gutter
    :hook (prog-mode . git-gutter-mode)
    :config
    (setq git-gutter:update-interval 0.02))

  (use-package git-gutter-fringe
    :config
    (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

#+end_src

#+RESULTS:
: t

** Theme

These days I bounce around between themes included with [[https://github.com/hlissner/emacs-doom-themes][DOOM Themes]] since they're well-designed and integrate with a lot of Emacs packages.

A nice gallery of Emacs themes can be found at https://emacsthemes.com/.

Alternate themes:

- =doom-snazzy=
- =doom-vibrant=

#+begin_src emacs-lisp

  ;;  (use-package spacegray-theme :defer t)
  (use-package doom-themes :defer t)
  (load-theme 'doom-city-lights t)
  (doom-themes-visual-bell-config)

#+end_src

#+RESULTS:
: t

** Font
