.emacs.d/init.el

(defvar efs/default-font-size 160)
(defvar efs/default-variable-font-size 160)

(set-face-attribute 'default nil :font "Fira Code Retina" :height efs/default-font-size)

;;Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height efs/default-font-size)

;;Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height efs/default-variable-font-size :weight 'regular)

(defun dw/replace-unicode-font-mapping (block-name old-font new-font)
  (let* ((block-idx (cl-position-if
                     (lambda (i) (string-equal (car i) block-name))
                     unicode-fonts-block-font-mapping))
         (block-fonts (cadr (nth block-idx unicode-fonts-block-font-mapping)))
         (updated-block (cl-substitute new-font old-font block-fonts :test 'string-equal)))
    (setf (cdr (nth block-idx unicode-fonts-block-font-mapping))
          `(,updated-block))))

(use-package unicode-fonts
  :disabled
  :custom
  (unicode-fonts-skip-font-groups '(low-quality-glyphs))
  :config
  ;; Fix the font mappings to use the right emoji font
  (mapcar
   (lambda (block-name)
     (dw/replace-unicode-font-mapping block-name "Apple Color Emoji" "Noto Color Emoji"))
   '("Dingbats"
     "Emoticons"
     "Miscellaneous Symbols and Pictographs"
     "Transport and Map Symbols"))
  (unicode-fonts-setup))

(use-package emojify
  :hook (erc-mode . emojify-mode)
  :commands emojify-mode)

(use-package diminish)

;; You must run (all-the-icons-install-fonts) one time after
;; (all-the-icons-install-fonts)
;; installing this package!

(use-package minions
  :hook (doom-modeline-mode . minions-mode))

;; ;; Better Modeline
;; (use-package all-the-icons)
;; (nerd-icons-install-fonts)

(use-package nerd-icons)

(use-package
  doom-modeline
  ;; :if (not (display-graphic-p))
  :init
  (setq doom-modeline-env-enable-python t)
  (setq doom-modeline-env-enable-go nil)
  (setq doom-modeline-buffer-encoding 'nondefault)
  (setq doom-modeline-hud t)
  (setq doom-modeline-persp-icon nil)
  (setq doom-modeline-persp-name nil)
  :config
  (setq doom-modeline-minor-modes nil)
  (setq doom-modeline-buffer-state-icon nil)
  (setq doom-modeline-icon nil)
  (doom-modeline-mode 1)
  (progn
    (require 'doom-modeline-segments)
    ;; https://martinralbrecht.wordpress.com/2020/08/23/conda-jupyter-and-emacs/
    (doom-modeline-def-segment
      conda-env
      "The current conda environment.  Works with `conda'."
      (when (bound-and-true-p conda-env-current-name)
        (propertize (format " |%s|" conda-env-current-name) 'face (if (doom-modeline--active)
                                                                      'mode-line
                                                                    'mode-line-inactive) 'help-echo
                                                                    (format "Conda environment: %s"
                                                                            conda-env-current-name)))))
  (doom-modeline-def-modeline
    'main
    '(bar workspace-name window-number modals matches buffer-info remote-host buffer-position
          word-count parrot selection-info conda-env)
    '(objed-state misc-info persp-name battery grip irc mu4e gnus github debug lsp minor-modes
                  input-method indent-info buffer-encoding major-mode process vcs checker)))

(use-package perspective
  :demand t
  :bind (("C-M-k" . persp-switch)
         ("C-M-n" . persp-next)
         ("C-x k" . persp-kill-buffer*))
  :custom
  (persp-initial-frame-name "Main")
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :config
  ;; Running `persp-mode' multiple times resets the perspective list...
  (unless (equal persp-mode t)
    (persp-mode)))

(use-package super-save
  :defer 1
  :diminish super-save-mode
  :config
  (super-save-mode +1)
  (setq super-save-auto-save-when-idle t))

;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

(dw/leader-key-def
  "t"  '(:ignore t :which-key "toggles")
  "tw" 'whitespace-mode
  "tt" '(counsel-load-theme :which-key "choose theme"))

(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
  (show-paren-mode 1))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(dw/leader-key-def
  "e"   '(:ignore t :which-key "eval")
  "eb"  '(eval-buffer :which-key "eval buffer"))

(dw/leader-key-def
  :keymaps '(visual)
  "er" '(eval-region :which-key "eval region"))

(use-package aggressive-indent
  :commands (aggressive-indent-mode))

(setq-default tab-width 4)
(setq-default evil-shift-width tab-width)

(setq-default python-indent 4)
(setq-default python-indent-offset 4)

(setq-default indent-tabs-mode nil)

(use-package ws-butler
  :hook ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode)
         (python-mode . ws-butler-mode)))

(use-package parinfer
  :disabled
  :hook ((clojure-mode . parinfer-mode)
         (emacs-lisp-mode . parinfer-mode)
         (common-lisp-mode . parinfer-mode)
         (scheme-mode . parinfer-mode)
         (lisp-mode . parinfer-mode))
  :config
  (setq parinfer-extensions
        '(defaults       ; should be included.
           pretty-parens  ; different paren styles for different modes.
           smart-tab      ; C-b & C-f jump positions and smart shift with tab & S-tab.
           smart-yank)))  ; Yank behavior depend on mode.

(dw/leader-key-def
  "tp" 'parinfer-toggle-mode)

(use-package origami
  :hook ((yaml-mode . origami-mode)
         (python-mode . origami-mode)))
