.emacs.d/Emacs.org
** org configuration
Set up Org Mode with a baseline configuration.  The following sections will add more things to it.

#+begin_src emacs-lisp
  ;; Org mode
  (setq-default fill-column 80)

  ;; Turn on indentation and auto-fill mode for Org files
  (defun dw/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil)
    (setq org-support-shift-select t)
    (diminish org-indent-mode))

  ;; Make sure Straight pulls Org from Guix
  (straight-use-package '(org :type built-in))

  (use-package org
    ;; :straight (org-plus-contrib
    ;;            :type git
    ;;            :host github
    ;;            :repo "emacs-straight/org-mode"
    ;;            :local-repo "org")
    ;; :straight (org-plus-contrib :repo "https://code.orgmode.org/bzg/org-mode.git" :local-repo "org" :files ("*.el" "lisp/*.el" "contrib/lisp/*.el"))
    :ensure t
    :defer t
    :hook ((org-mode . dw/org-mode-setup)
           (org-mode . my/org-fonts)
           (org-mode . my/org-block-templates))
    :config
    (setq org-ellipsis " "
          org-hide-emphasis-markers t
          org-src-fontify-natively t
          org-fontify-quote-and-verse-blocks t
          org-src-tab-acts-natively t
          org-edit-src-content-indentation 2
          org-hide-block-startup t
          org-src-preserve-indentation nil
          org-startup-folded nil
          org-cycle-separator-lines 2
          org-capture-bookmark nil)

    (setq org-modules
          '(org-crypt
            org-habit
            ))

    (setq org-refile-targets '((nil :maxlevel . 1)
                               (org-agenda-files :maxlevel . 1)))

    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-use-outline-path t)

    (evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'org-next-visible-heading)
    (evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'org-previous-visible-heading)

    (evil-define-key '(normal insert visual) org-mode-map (kbd "M-j") 'org-metadown)
    (evil-define-key '(normal insert visual) org-mode-map (kbd "M-k") 'org-metaup)

    (setq org-startup-with-inline-images t) ;; Display inline images on startup
    (setq org-confirm-babel-evaluate nil) ;; Don't prompt for confirmation when evaluating code blocks
    (add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append) ;; Display inline images

    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (shell . t)
       (ipython . t)
       (C . t)
       ))

    (push '("conf-unix" . conf-unix) org-src-lang-modes)

    (require 'ox-latex)
    (require 'ox-md))

  #+end_src

  #+RESULTS:
  | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-tempo-setup | (closure (bootstrap-version t) nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | rainbow-mode | org-appear-mode | evil-org-mode | org-superstar-mode | ob-ipython-auto-configure-kernels | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-make-toc-mode | my/org-block-templates | my/org-fonts | dw/org-mode-setup | dw/org-mode-visual-fill | (closure ((mode . org-mode-hook) (--dolist-tail--) bootstrap-version t) nil (display-line-numbers-mode 0)) |

** ob-ipython
#+begin_src emacs-lisp
  (use-package  ob-ipython
    :after org
    :config
    ;; set default ipython exex
    (setq org-babel-python-command "/home/leon/mambaforge/bin/python3")

    ;; fix bug with json and obipython
    (advice-add 'ob-ipython--collect-json :before
                (lambda (&rest args)
                  (let ((start (point)))
                    (set-mark (point))
                    (while (re-search-forward "{" nil t)
                      (backward-char)
                      (kill-region (region-beginning) (region-end))
                      (re-search-forward "}\n" nil t)
                      (set-mark (point)))
                    (end-of-buffer)
                    (kill-region (region-beginning) (region-end))
                    (goto-char start)))))

#+end_src

#+RESULTS:
: t

** ox-ipynb
#+begin_src emacs-lisp
  (use-package ox-ipynb
    :straight (ox-ipynb
               :type git
               :host github
               :repo "jkitchin/ox-ipynb")
    :after org
    :config
    (require 'ox-ipynb))

#+end_src

#+RESULTS:
: t

** Bullets
#+begin_src emacs-lisp
  ;; Use bullet characters instead of asterisks, plus set the header font sizes to something more palatable.  A fair amount of inspiration has been taken from [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][this blog post]].

  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("" "" "" "" "" "" "")))
  
#+end_src

#+RESULTS:
| org-tempo-setup | (closure (bootstrap-version t) nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | rainbow-mode | org-appear-mode | evil-org-mode | org-superstar-mode | ob-ipython-auto-configure-kernels | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-make-toc-mode | my/org-block-templates | my/org-fonts | dw/org-mode-setup | dw/org-mode-visual-fill | (closure ((mode . org-mode-hook) (--dolist-tail--) bootstrap-version t) nil (display-line-numbers-mode 0)) |

** Bindings

#+begin_src emacs-lisp

  (use-package evil-org
    :after org
    :hook ((org-mode . evil-org-mode)
           (org-agenda-mode . evil-org-mode)
           (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional)))))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

  (dw/leader-key-def
    "o"   '(:ignore t :which-key "org mode")

    "oi"  '(:ignore t :which-key "insert")
    "oil" '(org-insert-link :which-key "insert link")

    "on"  '(org-toggle-narrow-to-subtree :which-key "toggle narrow")

    "os"  '(dw/counsel-rg-org-files :which-key "search notes")

    "oa"  '(org-agenda :which-key "status")
    "ot"  '(org-todo-list :which-key "todos")
    "oc"  '(org-capture t :which-key "capture")
    "ox"  '(org-export-dispatch t :which-key "export"))

#+end_src

#+RESULTS:

** a few useful functions
*** Searching
#+begin_src emacs-lisp
  (defun dw/search-org-files ()
    (interactive)
    (counsel-rg "" "~/Notes" nil "Search Notes: "))
#+end_src

#+RESULTS:
: dw/search-org-files

** Update Table of Contents on Save
It's nice to have a table of contents section for long literate configuration files (like this one!) so I use =org-make-toc= to automatically update the ToC in any header with a property named =TOC=.
#+begin_src emacs-lisp

  (use-package org-make-toc
    :hook (org-mode . org-make-toc-mode))

#+end_src

#+RESULTS:
| org-tempo-setup | (closure (bootstrap-version t) nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | rainbow-mode | org-appear-mode | evil-org-mode | org-superstar-mode | ob-ipython-auto-configure-kernels | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-make-toc-mode | my/org-block-templates | my/org-fonts | dw/org-mode-setup | dw/org-mode-visual-fill | (closure ((mode . org-mode-hook) (--dolist-tail--) bootstrap-version t) nil (display-line-numbers-mode 0)) |

** Calendar Sync

#+begin_src emacs-lisp

  (use-package org-caldav
    :after org
    :init
    (require 'org-caldav)
    (setq org-caldav-url "https://caldav.fastmail.com/dav/calendars/user/daviwil@fastmail.fm/"
          ;; org-caldav-files '("~/Notes/Calendar/Personal.org" "~/Notes/Calendar/Work.org")
          ;; org-caldav-inbox '("~/Notes/Calendar/Personal.org" "~/Notes/Calendar/Work.org")
          org-caldav-calendar-id "fe098bfb-0726-4e10-bff2-55f8278c8a56"
          org-caldav-files '("~/Notes/Calendar/Personal.org")
          org-caldav-inbox "~/Notes/Calendar/PersonalInbox.org"
          org-caldav-calendars
          '((:calendar-id "fe098bfb-0726-4e10-bff2-55f8278c8a56"
                          :files ("~/Notes/Calendar/Personal.org")
                          :inbox "~/Notes/Calendar/PersonalInbox.org"))
          ;; (:calendar-id "8f150437-cc57-4ba0-9200-d1d98389e2e4"
          ;;  :files ("~/Notes/Calendar/Work.org")
          ;;  :inbox "~/Notes/Calendar/Work.org"))
          org-caldav-delete-org-entries 'always
          org-caldav-delete-calendar-entries 'never))

#+end_src

#+RESULTS:

** Reminders
#+begin_src emacs-lisp
  (use-package org-wild-notifier
    :after org
    :config
    ;; Make sure we receive notifications for non-TODO events
    ;; like those synced from Google Calendar
    (setq org-wild-notifier-keyword-whitelist nil)
    (setq org-wild-notifier-notification-title "Agenda Reminder")
    (setq org-wild-notifier-alert-time 15)
    (org-wild-notifier-mode))
#+end_src

#+RESULTS:
: t

** Presentations
