.emacs.d/init.el

(use-package cmake-mode
  :mode "CMakeLists\\.txt\\'"
  :mode "\\.cmake\\'")

(use-package python-mode
    :mode "\\.py\\'"
    :init
    (setq python-shell-interpreter "/home/leon/mambaforge/bin/python3")

    :custom
    (dap-python-executable "/home/leon/mambaforge/bin/python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))

;; (use-package py-isort
;;   :hook (python-mode . py-isort-before-save)
;;   :config
;;   (setq py-isort-options '("--lines=88" "-m=3" "-tc" "-fgw=0" "-ca"))) ;

(defun call-isort ()
  "Call the isort command on the current buffer"
  (interactive)
  (shell-command-on-region (point-min)
                           (point-max)
                           "isort -"
                           (current-buffer)
                           t))

(add-hook 'python-mode-hook
          (lambda ()
            (add-hook 'before-save-hook 'call-isort nil t)))

  ;; (use-package py-autoflake
  ;;       :hook (python-mode . py-autoflake-enable-on-save)
  ;;       :config
  ;;       (setq py-autoflake-options '("--expand-star-imports")))

  ;; (use-package py-docformatter
  ;;       :hook (python-mode . py-docformatter-enable-on-save)
  ;;       :config
  ;;       (setq py-docformatter-options '("--wrap-summaries=88" "--pre-summary-newline")))

  (use-package python-docstring
    :hook (python-mode . python-docstring-mode))

  (use-package blacken
    :hook (python-mode . blacken-mode)
      :config (setq blacken-line-length '88))

  (use-package python-black
    :straight t
    :hook (python-mode . python-black-on-save-mode-enable-dwim))

  (defun leon/eglot-format-buffer ()
    "Format current buffer according to LSP server."
    (interactive)
    (if (and (eq major-mode 'python-mode) (executable-find "black"))
        (python-black-buffer)
      (eglot--format-buffer)))

(use-package
  conda
  :config (conda-env-autoactivate-mode t)
  ;; TODO: we need to activate the envs for python files but not for, e.g., jupyter repl buffer
  :hook (python-mode . (lambda () (conda-env-activate-for-buffer))))

(use-package pyvenv
  :ensure t
  :after conda
  :hook (python-mode . pyvenv-mode)
  :init
  (setenv "WORKON_HOME" "/home/leon/mambaforge/envs/")
  :config
  (setq pyvenv-workon "/home/leon/mambaforge/envs/"))

(use-package ein
  :config
