.emacs.d/Emacs.org
**** Ein
#+begin_src emacs-lisp

  (use-package ein
    :config
    (setq ein:output-area-inlined-images t)
    (setq ein:slice-image t)
    (setq ein:completion-backend 'ein:use-company-backend)
    (evil-define-key 'normal ein:notebook-multilang-mode-map
      (kbd "RET") 'ein:worksheet-execute-cell-and-goto-next)
    (evil-define-key 'normal ein:notebook-mode-map
      (kbd "RET") 'ein:worksheet-execute-cell-and-goto-next)
    (add-hook 'ein:notebook-mode-hook #'evil-normal-state)

    (defun save-and-keep-state (&rest args)
      (let ((current-state evil-state)) ; capture current state
        (apply args)                    ; apply original function
        (evil-change-state current-state))) ; return to captured state

    (advice-add 'ein:notebook-save-notebook-command :around #'save-and-keep-state)

    (add-hook 'ein:notebook-mode-hook 'undo-tree-mode)

    (defun custom:notebook-mode-hook ()
      (evil-set-initial-state 'ein:notebook-multilang-mode 'insert))
    (add-hook 'ein:notebook-mode-hook 'custom:notebook-mode-hook))

  ;; (use-package company
  ;;   :ensure t
  ;;   :config
  ;;   (setq company-idle-delay .2)
  ;;   (setq company-minimum-prefix-length 2)
  ;;   (add-hook 'ein:notebook-multilang-mode-hook 'company-mode))  ;; enable company-mode only in ein

  ;; (use-package company-prescient
  ;;   :after company
  ;;   :config
  ;;   (company-prescient-mode))

  ;; (use-package company-box
  ;;   :after company
  ;;   :hook (company-mode . company-box-mode))

#+end_src

#+RESULTS:
| company-box-mode | company-mode-set-explicitly |

*** Emacs Lisp

#+begin_src emacs-lisp

  (add-hook 'emacs-lisp-mode-hook #'flycheck-mode)

  (use-package helpful
    :ensure t
    :bind (("C-h f" . helpful-callable)
           ("C-h v" . helpful-variable)
           ("C-h k" . helpful-key))
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable))

  (dw/leader-key-def
    "e"   '(:ignore t :which-key "eval")
    "eb"  '(eval-buffer :which-key "eval buffer"))

  (dw/leader-key-def
    :keymaps '(visual)
    "er" '(eval-region :which-key "eval region"))

#+end_src

#+RESULTS:
: helpful-key

*** HTML

#+begin_src emacs-lisp

  (use-package web-mode
    :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
    :config
    (setq-default web-mode-code-indent-offset 2)
    (setq-default web-mode-markup-indent-offset 2)
    (setq-default web-mode-attribute-indent-offset 2))

  ;; 1. Start the server with `httpd-start'
  ;; 2. Use `impatient-mode' on any buffer
  (use-package impatient-mode
    :after web-mode)

  (use-package skewer-mode
    :after web-mode)

#+end_src

#+RESULTS:

** Compilation
Set up the =compile= package and ensure that compilation output automatically scrolls.

#+begin_src emacs-lisp
  (use-package compile
    :custom
    (compilation-scroll-output t))

  (defun auto-recompile-buffer ()
    (interactive)
    (if (member #'recompile after-save-hook)
        (remove-hook 'after-save-hook #'recompile t)
      (add-hook 'after-save-hook #'recompile nil t)))

#+end_src

#+RESULTS:
: auto-recompile-buffer

** Productivity
*** agressive indent
#+begin_src emacs-lisp
  (use-package aggressive-indent
    :commands (aggressive-indent-mode))
#+end_src
#+RESULTS:
*** Syntax checking with Flycheck

#+begin_src emacs-lisp
  (use-package flycheck
    :config
    (flycheck-define-checker python-ruff
      "A Python syntax and style checker using the ruff utility.
      To override the path to the ruff executable, set
      `flycheck-python-ruff-executable'.
      See URL `http://pypi.python.org/pypi/ruff'."
      :command ("ruff"
                "--format=text"
                (eval (when buffer-file-name
                        (concat "--stdin-filename=" buffer-file-name)))
                "-")
      :standard-input t
      :error-filter (lambda (errors)
                      (let ((errors (flycheck-sanitize-errors errors)))
                        (seq-map #'flycheck-flake8-fix-error-level errors)))
      :error-patterns
      ((warning line-start
                (file-name) ":" line ":" (optional column ":") " "
                (id (one-or-more (any alpha)) (one-or-more digit)) " "
                (message (one-or-more not-newline))
                line-end))
      :modes python-mode)
    (add-to-list 'flycheck-checkers 'python-ruff)
    :init (global-flycheck-mode))

  (use-package flycheck-pycheckers
  :ensure t
  :after flycheck
  :config
  (with-eval-after-load 'flycheck
    (add-hook 'flycheck-mode-hook #'flycheck-pycheckers-setup)))

#+end_src

#+RESULTS:
: t

*** tree-sitter
#+begin_src emacs-lisp
  ;; code parsing
  (use-package tree-sitter
    :hook (python-mode . tree-sitter-mode)
    :hook (python-mode . tree-sitter-hl-mode))

  (use-package tree-sitter-langs
    :after tree-sitter)

#+end_src

#+RESULTS:
*** treemacs
#+begin_src emacs-lisp
  (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum-face
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once)
    :ensure t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
    :after (treemacs persp-mode) ;;or perspective vs. persp-mode
    :ensure t
    :config (treemacs-set-scope-type 'Perspectives))

#+end_src

#+RESULTS:

