.emacs.d/init.el

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode))
  :init (setq markdown-command "/usr/local/bin/multimarkdown"))

(use-package polymode)
(use-package poly-markdown)
(use-package request)

(use-package quarto-mode
  :mode ((".qmd\\.Rmd\\'" . poly-quarto-mode))
  :config
  (require 'polymode)
  (require 'poly-markdown)
  (require 'request))

(use-package leetcode
  :config
  (setq leetcode-prefer-language "python3")
  (setq leetcode-prefer-sql "mysql")
  (setq leetcode-save-solutions t)
  (setq leetcode-directory "~/leetcode"))

(use-package gptel
  :straight '(gptel :host github
                    :repo "karthink/gptel"
                    :branch "master")

  :init
  (setq-default gptel-model "gpt-3.5-turbo"
                gptel-playback t
                gptel-api-key (lambda () (string-trim (shell-command-to-string "pass openai")))
                gptel-default-mode 'org-mode))

(use-package copilot
  :straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
  :after company
  :config (delq 'company-preview-if-just-one-frontend company-frontends)
  (define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
  (define-key copilot-completion-map (kbd "TAB") 'copilot-accept-completion)
  :hook ((prog-mode . (lambda () (unless (equal (buffer-name) "*scratch*") copilot-mode)))))

;; move between buffer with "\C-xp"
(global-set-key (kbd "C-x p") (lambda () (interactive) (other-window -1)))

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))

(defun efs/org-babel-tangle-config ()
  "Automatically tangle our Emacs.org config file when we save it."
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/Emacs_cluster.org"))

    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
